spec/support/stripe/success.json

{"id":"ch_41ta68gpPILH6o","object":"charge","created":1400025555,"livemode":false,"paid":true,"amount":400,"currency":"usd","refunded":false,"card":{"id":"card_41taBkXGJvZoMn","object":"card","last4":"4242","type":"Visa","exp_month":5,"exp_year":2019,"fingerprint":"7B7Qe68f5x0JA8uM","customer":null,"country":"US","name":null,"address_line1":null,"address_line2":null,"address_city":null,"address_state":null,"address_zip":null,"address_country":null,"cvc_check":"pass","address_line1_check":null,"address_zip_check":null},"captured":true,"refunds":[],"balance_transaction":"txn_41taHC5U4oGqtS","failure_message":null,"failure_code":null,"amount_refunded":0,"customer":null,"invoice":null,"description":null,"dispute":null,"metadata":{},"statement_description":null}